dist/test.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-03-12 Fri 00:21 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Blogs and Wikis with Org</title>
<meta name="author" content="Worg people" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="index.html"> UP </a>
 |
 <a accesskey="H" href="https://orgmode.org/worg/"> HOME </a>
</div><div id="content">
<h1 class="title">Blogs and Wikis with Org</h1>
<p>
{Back to Worg&rsquo;s index}
</p>

<p>
There is a strong desire to use Org-mode to manage both blogs and
wikis.  There are a number of tools which address parts of this need, this
page will serve as a collecting of the names of these tools with links and
brief descriptions.  I&rsquo;m sure I&rsquo;ve forgotten many relevant tools so <b>please
contribute</b>!
</p>

<div id="outline-container-org91cb08b" class="outline-2">
<h2 id="org91cb08b">Blogging tools</h2>
<div class="outline-text-2" id="text-org91cb08b">
<dl class="org-dl">
<dt>o-blog</dt><dd>Stand-alone blogging system that does not require any external
software (features, Github source).</dd>

<dt>Jekyll</dt><dd>a simple, blog aware, static site generator.  There are
instructions for combining Org-mode with jekyll at Org-Jekyll.</dd>

<dt>Projects</dt><dd>In most cases using Org-mode publishing projects with
its many options should be sufficient for publishing a blog.</dd>

<dt>Blorgit</dt><dd>publish an interactive website based on Org-mode
documents.  While blorgit has many nice features including the
fact that Org-mode documents can be edited through the web
interface with automatic commits to a git or svn repository
however it is fairly complicated to set up.  Blorgit is one or
two small changes from being a full-fledged Org-mode based wiki.
This is no longer maintained, see org-ehtml in the wiki section
below.</dd>

<dt>blog-files</dt><dd>A simple system based on ideas and code from
org-jekyll and reprise.py to publish a blog using simple static
html pages.</dd>

<dt>org2blog</dt><dd>allows publishing directly from Org-mode to WordPress</dd>

<dt>Org-mode and Octopress</dt><dd>Instructions for blogging With Org-mode
and Octopress.  There is also this dedicated exporter by Tom
Alexander (instructions here.)</dd>

<dt>Blorg</dt><dd>the original Org-mode blogging engine (but it&rsquo;s not
maintained anymore).  Roland Kaufmann is maintaining a fork here.</dd>

<dt>a blog-like sitemap for org-publish</dt><dd>see this post by Jon Anders
Skorpen.</dd>

<dt>Org-mode and Nikola</dt><dd>A plugin for Nikola (a static site generator
in Python), that lets you write your posts in org-mode syntax.</dd>

<dt>org-page</dt><dd>A static blog-site generator, written in elisp. Very
light weight. Integrated with git. Supports themeing. Uses
mustache for templating. Highly customizable. Key difference from
o-blog is that org-page posts are in <b>separate</b> org-files. Built-in
support for disqus, google-analytics and RSS.</dd>

<dt>lazyblorg</dt><dd>a static blog-site generator written in Python (HTML5,
CSS3). Focus is to have only an absolutely <i>minimum</i> of things to
do to write a new blog entry <i>everywhere</i> in your set of Org-mode
files. The software is currently in development. However, basic
functionality is working: tagging, Atom feeds, basic Org-mode
syntax parser with Pandoc fall-back, hidden blog entries,
auto-tags for language, tag cloud link page, tag description
pages, and such. You can take a look at Karl Voit&rsquo;s personal web
page to see an example result. Great features are planned for the
future: auto-tags for article length, overview pages for
navigation, extremely easy integration of image files through a
memacs module, and so forth.</dd>

<dt>Hugo</dt><dd>Hugo fast static blog engine supports Org files natively.</dd>

<dt>ox-hugo</dt><dd><p>
An Org exporter backend that exports to
Hugo/Blackfriday-friendly Markdown, along with Hugo front-matter
in TOML or YAML. This package was developed after being aware of
the fact that Hugo natively supports parsing Org (but that
support is only partial).. read more on Why <code>ox-hugo</code>?
</p>

<p>
<code>ox-hugo</code> enables writing posts for Hugo in <b>native Org mode</b>. It
allows converting your existing Org files to blog posts with
almost no modification. Two common Org blogging flows are
supported:
</p>
<ul class="org-ul">
<li>Exporting multiple Org sub-trees from a single file to multiple
Hugo posts. With this feature, one can produce a whole web site
from a single Org file (the <code>ox-hugo</code> documentation site is one
such example, which is generated from this one Org file). It also
leverages Org tag and property inheritance, and much more!</li>
<li>Exporting a single Org file to a single Hugo post.</li>
</ul>

<p>
See the package&rsquo;s website for complete documentation, and the test
site [source] for hundreds of test cases and feature
demonstrations.
</p></dd>

<dt>org-static-blog</dt><dd>This is a blog generator that focuses on being
simple.  It has no dependency beside Emacs.  All files are simple
org-mode files in a directory.  The index, the archive and the
RSS feed are automatically generated.  See Basti&rsquo;s website for an
example.</dd>
</dl>
</div>
</div>

<div id="outline-container-orgd2887c4" class="outline-2">
<h2 id="orgd2887c4">Wiki tools</h2>
<div class="outline-text-2" id="text-orgd2887c4">
<ul class="org-ul">
<li><p>
ikiwiki is a web site compiler written in Perl.  In many ways it is
similar to Jekyll, but has closer integration with version control
systems.  It supports blogging and has many plugins.
</p>

<p>
There is an org mode plugin by Manoj, which lets you write your posts in
org and converts them to html suitable for processing by ikiwiki.
</p>

<p>
There is another plugin by Chris Gray that interprets org files.  It
is still under intermittent development, but is stable enough for
general use.
</p></li>

<li>Org-ehtml defines an editable HTML backend for the new exporting
engine.  Org-ehtml runs on an Emacs web server.  Exported Org-mode
web pages may be edited through a web browser, the edits may then be
saved to Org-mode files on the computer running the server, and may
even be committed to a version control system (experimental)
providing wiki functionality.  There is also experimental support
for password authentication.  Also see the initial announcement
email on the Org-mode mailing list.</li>
</ul>
</div>
</div>

<div id="outline-container-org9bddedf" class="outline-2">
<h2 id="org9bddedf">Other tools</h2>
<div class="outline-text-2" id="text-org9bddedf">
<ul class="org-ul">
<li>org-ruby is a Ruby gem for converting org-mode files to HTML. The goal is
to make it easier to use org-mode files in website tools like Webby,
Jekyll, or webgen.</li>
</ul>
</div>
</div>

<div id="outline-container-org13d622d" class="outline-2">
<h2 id="org13d622d">More links</h2>
<div class="outline-text-2" id="text-org13d622d">
<ul class="org-ul">
<li>Writing and blogging with org-mode</li>
<li>Using Emacs org-mode for web publishing</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Worg people</p>
<p class="date">Created: 2021-03-12 Fri 00:21</p>
</div>
</body>
</html>
